; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v5 ?v7)
		(pred_3 ?v8)
		(pred_5 ?v4)
		(pred_2 ?v4)
		(pred_4 ?v8 ?v4)
		(pred_1)
		(pred_6 ?v8))

   (:action op_3
       :parameters  (?v6 ?v3)
       :precondition (and (not-eq ?v6 ?v3) 
                          (pred_5 ?v6) (pred_5 ?v3) (pred_2 ?v6))
       :effect (and  (pred_2 ?v3)
		     (not (pred_2 ?v6))))


   (:action op_1
       :parameters (?v2 ?v1)
       :precondition  (and  (pred_3 ?v2) (pred_5 ?v1)
			    (pred_4 ?v2 ?v1) (pred_2 ?v1) (pred_1))
       :effect (and (pred_6 ?v2)
		    (not (pred_4 ?v2 ?v1)) 
		    (not (pred_1))))

   (:action op_2
       :parameters  (?v2  ?v1)
       :precondition  (and  (pred_3 ?v2) (pred_5 ?v1)
			    (pred_6 ?v2) (pred_2 ?v1))
       :effect (and (pred_4 ?v2 ?v1)
		    (pred_1)
		    (not (pred_6 ?v2)))))

; problem
(define (problem ferry-l4-c2)
(:domain ferry)
(:objects obj_06 obj_03 obj_04 obj_05 
          obj_01 obj_02 
)
(:init
(pred_5 obj_06)
(pred_5 obj_03)
(pred_5 obj_04)
(pred_5 obj_05)
(pred_3 obj_01)
(pred_3 obj_02)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(pred_1)
(pred_4 obj_01 obj_03)
(pred_4 obj_02 obj_05)
(pred_2 obj_06)
)
(:goal
(and
(pred_4 obj_01 obj_05)
(pred_4 obj_02 obj_03)
)
)

(:constraints
  (and
    (sometime-before  (pred_4 obj_01 obj_05) (pred_2 obj_04))
    (sometime-before  (pred_4 obj_02 obj_03) (pred_2 obj_04))
  )
)
)

; plan
1. (op_3 obj_06 obj_03)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_03)
   goals met: 0 of 2
2. (op_1 obj_01 obj_03)
   deleted: (pred_4 obj_01 obj_03) (pred_1)
   added: (pred_6 obj_01)
   goals met: 0 of 2
3. (op_3 obj_03 obj_04)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_04)
   goals met: 0 of 2
4. (op_2 obj_01 obj_04)
   deleted: (pred_6 obj_01)
   added: (pred_4 obj_01 obj_04) (pred_1)
   goals met: 0 of 2
5. (op_3 obj_04 obj_05)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_05)
   goals met: 0 of 2
6. (op_1 obj_02 obj_05)
   deleted: (pred_4 obj_02 obj_05) (pred_1)
   added: (pred_6 obj_02)
   goals met: 0 of 2
7. (op_3 obj_05 obj_03)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_03)
   goals met: 0 of 2
8. (op_2 obj_02 obj_03)
   deleted: (pred_6 obj_02)
   added: (pred_4 obj_02 obj_03) (pred_1)
   goals met: 1 of 2
9. (op_3 obj_03 obj_04)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_04)
   goals met: 1 of 2
10. (op_1 obj_01 obj_04)
   deleted: (pred_4 obj_01 obj_04) (pred_1)
   added: (pred_6 obj_01)
   goals met: 1 of 2
11. (op_3 obj_04 obj_05)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_05)
   goals met: 1 of 2
12. (op_2 obj_01 obj_05)
   deleted: (pred_6 obj_01)
   added: (pred_4 obj_01 obj_05) (pred_1)
   goals met: 2 of 2
